Public Attributes | List of all members
API_AnalyticalMemberPartRef Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Member part. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_Guid  | elemGuid
The references Structural Analytical Model Member.
 API_AnalyticalMemberPartRefType  | partRefType
The type of the reference.
 API_InternalAnalyticalMemberPartId  | partId
Identifies the edge or the vertex.
 API_AMPartRefCustomVertexData  | customVertexData
Contains the vertex coordinate when partRefType is API_AMPartRef_CustomVertex.
 API_AMPartRefRatioEdgeData  | ratioEdgeData
Contains the ratios when partRefType is API_AMPartRef_RatioEdge.
Detailed Description
Describes a Structural Analytical Model Analytical Member part.
Since
Archicad 25